# GetWaterLoopData Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPAnalyticalSystem..::..GetWaterLoopData Method
MEPAnalyticalSystem Class See Also
---
Returns the water loop data, null if not available.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public WaterLoopData GetWaterLoopData()
```

Visual Basic
---
```text
Public Function GetWaterLoopData As WaterLoopData
```

Visual C++
---
```text
public:
WaterLoopData^ GetWaterLoopData()
```

# See Also
MEPAnalyticalSystem Class
Autodesk.Revit.DB.Mechanical Namespace